/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"microsoft.c.cpp.extension": "Extensão do Microsoft C/C++",
	"c.cpp.extension": "Extensão de C/C++",
	"open.this.editor": "Abra este editor usando o comando:",
	"edit.configurations.ui": "C/C++: editar configurações (IU)",
	"switch.to.json": "Alterne para o arquivo {0} clicando no link do arquivo ou usando o comando:",
	"edit.configurations.in.json": "Editar as configurações no arquivo JSON",
	"edit.configurations.json": "C/C++: editar configurações (JSON)",
	"check.the.schema": "Saiba mais sobre as propriedades de C/C++ acessando {0}.",
	"view.schema.reference": "Referência de Esquema de Propriedades",
	"intellisense.configurations": "Configurações do IntelliSense",
	"intellisense.configurations.description": "Use este editor para editar as configurações do IntelliSense definidas no arquivo {0} subjacente. As alterações feitas neste editor se aplicam somente à configuração selecionada. Para editar várias configurações ao mesmo tempo, vá para {1}.",
	"configuration.name": "Nome da configuração",
	"configuration.name.description": "Um nome amigável que identifica uma configuração. {0}, {1} e {2} são identificadores especiais para as configurações que serão selecionadas automaticamente nessas plataformas.",
	"select.configuration.to.edit": "Selecione um conjunto de configurações a ser editado.",
	"add.configuration.button": "Adicionar Configuração",
	"configuration.name.input": "Nome da configuração...",
	"ok.button": "OK",
	"cancel.button": "CANCELAR",
	"compiler.path": "Caminho do compilador",
	"compiler.path.description": "O caminho completo para o compilador usado para compilar o projeto. Por exemplo, {0}, para habilitar o IntelliSense mais preciso. A extensão consultará o compilador para determinar as definições padrão e os caminhos de inclusão do sistema a serem usados para o IntelliSense.",
	"specify.a.compiler": "Especifique um caminho do compilador ou selecione um caminho de compilador detectado na lista suspensa.",
	"no.compiler.paths.detected": "(Nenhum caminho de compilador detectado)",
	"compiler.args": "Argumentos do compilador",
	"compiler.arguments": "Argumentos do compilador para modificar as inclusões ou definições usadas, por exemplo, {0}, {1} etc.",
	"one.argument.per.line": "Um argumento por linha.",
	"intellisense.mode": "Modo do IntelliSense",
	"intellisense.mode.description": "O modo do IntelliSense a ser usado, que é mapeado para uma plataforma e uma variante de arquitetura do MSVC, do gcc ou do Clang. Se esta opção não for definida ou se for definida como {0}, a extensão escolherá o padrão dessa plataforma. O Windows usa {1}, o Linux usa {2} e o macOS usa {3} como padrão. Selecione um modo do IntelliSense específico para substituir o modo {4}. Os modos do IntelliSense que só especificam variantes {5} (por exemplo, {6}) são os modos herdados, que são convertidos automaticamente nas variantes {7} com base na plataforma host.",
	"include.path": "Incluir caminho",
	"include.path.description": "Um caminho de inclusão é uma pasta que contém os arquivos de cabeçalho (como {0}) que estão incluídos em um arquivo de origem. Especifique uma lista de caminhos para o mecanismo IntelliSense usar ao procurar arquivos de cabeçalho incluídos. A pesquisa nesses caminhos não é recursiva. Especifique {1} para indicar uma pesquisa recursiva. Por exemplo, {2} pesquisará em todos os subdiretórios, enquanto {3} não fará isso. No Windows com o Visual Studio instalado ou quando um compilador está especificado na configuração {4}, não é necessário listar os caminhos de inclusão do sistema nessa lista.",
	"one.include.path.per.line": "Um caminho de inclusão por linha.",
	"defines": "Define",
	"defines.description": "Uma lista de definições de pré-processador para o mecanismo IntelliSense usar durante a análise de arquivos. Opcionalmente, use {0} para definir um valor, por exemplo, {1}.",
	"one.definition.per.line": "Uma definição por linha.",
	"c.standard": "Padrão C",
	"c.standard.description": "A versão do padrão da linguagem C a ser usada para o IntelliSense. Observação: os padrões GNU são usados apenas para consultar o compilador de conjunto para obter definições de GNU e o IntelliSense emulará a versão padrão do C equivalente.",
	"cpp.standard": "Padrão de C++",
	"cpp.standard.description": "A versão do padrão de linguagem C++ a ser usada para o IntelliSense. Observação: os padrões GNU são usados apenas para consultar o compilador de conjunto para obter definições de GNU e o IntelliSense emulará a versão do C++ padrão equivalente.",
	"advanced.settings": "Configurações Avançadas",
	"configuration.provider": "Provedor de configuração",
	"configuration.provider.description": "A ID de uma extensão do VS Code que pode fornecer informações de configuração de IntelliSense para arquivos de origem. Por exemplo, use a ID de extensão do VS Code {0} para fornecer informações de configuração da extensão de Ferramentas CMake.",
	"windows.sdk.version": "Versão do SDK do Windows",
	"windows.sdk.version.description": "A versão do caminho de inclusão SDK do Windows a ser usada no Windows, por exemplo, {0}.",
	"mac.framework.path": "Caminho da estrutura do Mac",
	"mac.framework.path.description": "Uma lista de caminhos para o mecanismo IntelliSense usar durante a pesquisa de cabeçalhos incluídos por meio das estruturas Mac. Compatível somente com configurações do macOS.",
	"one.path.per.line": "Um caminho por linha.",
	"forced.include": "Inclusão forçada",
	"forced.include.description": "Uma lista de arquivos que devem ser incluídos antes que quaisquer outros caracteres no arquivo de origem sejam processados. Os arquivos são incluídos na ordem listada.",
	"one.file.per.line": "Um arquivo por linha.",
	"dot.config": "Configuração de Ponto",
	"dot.config.description": "Um caminho para um arquivo .config criado pelo sistema Kconfig. O sistema Kconfig gera um arquivo com todas as definições para construir um projeto. Exemplos de projetos que utilizam o sistema Kconfig são o Kernel Linux e o NuttX RTOS.",
	"compile.commands": "Compilar comandos",
	"compile.commands.description": "O caminho completo para o arquivo {0} para o workspace. Os caminhos de inclusão e as definições descobertas neste arquivo serão usados no lugar dos valores definidos para as configurações {1} e {2}. Se o banco de dados de comandos de compilação não contiver uma entrada para a unidade de tradução que corresponda ao arquivo aberto no editor, uma mensagem de aviso será exibida e, em vez disso, a extensão usará as configurações {3} e {4}.",
	"merge.configurations": "Mesclar as configurações",
	"merge.configurations.description": "Quando definido como {0} (ou verificado), mesclar os caminhos de inclusão, definições e inclusões forçadas com aqueles de um provedor de configuração.",
	"browse.path": "Procurar: caminho",
	"browse.path.description": "Uma lista de caminhos para o Analisador de Marca pesquisar os cabeçalhos incluídos pelos arquivos de origem. Se omitido, {0} será usado como o {1}. A pesquisa nesses caminhos é recursiva por padrão. Especifique {2} para indicar pesquisa não recursiva. Por exemplo: {3} pesquisará todos os subdiretórios enquanto {4} não pesquisará.",
	"one.browse.path.per.line": "Um caminho de pesquisa por linha.",
	"limit.symbols": "Procurar: limitar símbolos a cabeçalhos incluídos",
	"limit.symbols.checkbox": "Quando {0} (ou marcado), o Analisador de Marca analisará somente os arquivos de código que foram diretamente ou indiretamente incluídos em um arquivo de origem no {1}. Quando {2} (ou não marcado), o Analisador de Marca analisará todos os arquivos de código encontrados nos caminhos especificados na lista de {3}.",
	"database.filename": "Procurar: nome do arquivo do banco de dados",
	"database.filename.description": "O caminho para o banco de dados de símbolos gerado. Isso instrui a extensão a salvar o banco de dados de símbolos do Analisador de Marca em algum lugar que não seja o local de armazenamento padrão do workspace. Se um caminho relativo for especificado, ele será criado em relação ao local de armazenamento padrão do workspace e não à própria pasta do workspace. A variável {0} pode ser usada para especificar um caminho relativo à pasta do workspace (por exemplo, {1})"
}