/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"incompatible.extension.heading": "Несовместимые или несоответствующие двоичные файлы расширения C/C++",
	"incompat.extension.text1": "Расширение C/C++ включает собственные двоичные файлы.",
	"incompat.extension.text2": "При установке через пользовательский интерфейс Marketplace в VS Code должны быть включены подходящие собственные двоичные файлы. Если обнаружены несовместимые двоичные файлы и расширение C/C++ было установлено через пользовательский интерфейс Marketplace в VS Code, {0}.",
	"bug.report.link.title": "сообщите о проблеме",
	"reinstalling.extension.heading": "Переустановка расширения C/C++",
	"reinstall.extension.text1": "При повторной установке эквивалентной версии расширения VS Code может повторно использовать существующий каталог расширений. Чтобы предотвратить переустановку расширения C/C++, может потребоваться сначала удалить существующий каталог расширений.",
	"reinstall.extension.text2": "Каталоги установленных расширений можно найти по одному из следующих путей в каталоге пользователя (`%USERPROFILE%` в Windows или ` $HOME` в Linux и macOS)",
	"reinstall.extension.text3": "При удаленном подключении:",
	"reinstall.extension.text4": "Примеры путей к каталогам установленного расширения C/C++:",
	"reinstall.extension.text5": "В Windows:",
	"reinstall.extension.text6": "В Linux:",
	"reinstall.extension.text7": "Затем переустановите с помощью пользовательского интерфейса Marketplace в VS Code.",
	"reinstall.extension.text8": "Если не удается развернуть правильную версию расширения с помощью VS Code, правильный файл VSIX для системы можно {0} и установить с помощью параметра `Установить из VSIX...` в разделе “...” меню в пользовательском интерфейсе Marketplace в VS Code.",
	"download.vsix.link.title": "скачано с веб-сайта Marketplace VS Code"
}