/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"microsoft.c.cpp.extension": "Rozšíření Microsoft C/C++",
	"c.cpp.extension": "Rozšíření C/C++",
	"open.this.editor": "Otevřít tento editor pomocí příkazu:",
	"edit.configurations.ui": "C/C++: Upravit konfigurace (uživatelské rozhraní)",
	"switch.to.json": "Pokud se chcete přepnout na soubor {0}, klikněte na odkaz na soubor nebo použijte příkaz:",
	"edit.configurations.in.json": "Upravit konfigurace v souboru JSON",
	"edit.configurations.json": "C/C++: Upravit konfigurace (JSON)",
	"check.the.schema": "Další informace o vlastnostech jazyků C/C++ najdete tady: {0}",
	"view.schema.reference": "Referenční informace ke schématu vlastností",
	"intellisense.configurations": "Konfigurace IntelliSense",
	"intellisense.configurations.description": "Pomocí tohoto editoru můžete upravovat nastavení IntelliSense definovaná v základním souboru {0}. Změny provedené v tomto editoru se budou vztahovat jen na vybranou konfiguraci. Pokud chcete upravit více konfigurací najednou, přejděte na {1}.",
	"configuration.name": "Název konfigurace",
	"configuration.name.description": "Popisný název, který identifikuje konfiguraci. {0}, {1} a {2} jsou speciální identifikátory pro konfigurace, které se na daných platformách automaticky vyberou.",
	"select.configuration.to.edit": "Vyberte sadu konfigurací, která se má upravit.",
	"add.configuration.button": "Přidat konfiguraci",
	"configuration.name.input": "Název konfigurace...",
	"ok.button": "OK",
	"cancel.button": "ZRUŠIT",
	"compiler.path": "Cesta ke kompilátoru",
	"compiler.path.description": "Úplná cesta ke kompilátoru, pomocí kterého sestavíte svůj projekt, třeba {0}. Umožní přesnější IntelliSense. Rozšíření pošle kompilátoru dotaz, aby určilo systémové cesty pro vložené soubory a výchozí direktivy define, které se použijí pro IntelliSense.",
	"specify.a.compiler": "Zadejte cestu ke kompilátoru nebo vyberte zjištěnou cestu z rozevíracího seznamu.",
	"no.compiler.paths.detected": "(Nezjistily se žádný cesty ke kompilátoru.)",
	"compiler.args": "Argumenty kompilátoru",
	"compiler.arguments": "Argumenty kompilátoru, které upraví použité direktivy include a define, např. {0}, {1} atd.",
	"one.argument.per.line": "Na každý řádek jeden argument",
	"intellisense.mode": "Režim IntelliSense",
	"intellisense.mode.description": "Režim IntelliSense, který se použije a mapuje na variantu platformy a architektury MSVC, gcc nebo Clangu. Pokud se nenastaví nebo nastaví na {0}, rozšíření zvolí výchozí režim pro danou platformu. Výchozí možnost pro Windows je {1}, pro Linux {2} a pro macOS {3}. Pokud chcete přepsat režim {4}, vyberte konkrétní režim IntelliSense. Režimy IntelliSense, které specifikují pouze varianty {5} (např. {6}), jsou starší režimy a automaticky se převádí na varianty {7} založené na hostitelské platformě.",
	"include.path": "Zahrnout cestu",
	"include.path.description": "Cesta pro vložené soubory je složka, která obsahuje hlavičkové soubory (třeba {0}) zahrnuté do zdrojového souboru. Zadejte seznam cest, které modul IntelliSense použije při hledání zahrnutých hlavičkových souborů. Vyhledávání v těchto cestách není rekurzivní. Rekurzivní vyhledávání můžete zapnout zadáním přepínače {1}. Například při zadání {2} se budou prohledávat všechny podadresáře, zatímco při zadání {3} nebudou. Pokud používáte Windows s nainstalovanou sadou Visual Studio nebo pokud je v nastavení {4} zadaný kompilátor, není nutné v tomto seznamu uvádět cesty pro systémové vložené soubory.",
	"one.include.path.per.line": "Na každý řádek jedna cesta pro vložené soubory",
	"defines": "Direktivy define",
	"defines.description": "Seznam definic preprocesoru, které modul IntelliSense použije při parsování souborů. Volitelně můžete pomocí {0} nastavit hodnotu, třeba {1}.",
	"one.definition.per.line": "Na každý řádek jedna definice",
	"c.standard": "Standard C",
	"c.standard.description": "Verze standardu jazyka C, která se použije pro IntelliSense. Poznámka: Standardy GNU se používají jen k odeslání dotazu nastavenému kompilátoru, aby se získaly definice GNU. IntelliSense bude emulovat ekvivalentní verzi standardu C.",
	"cpp.standard": "Standard C++",
	"cpp.standard.description": "Verze standardu jazyka C++, která se použije pro IntelliSense. Poznámka: Standardy GNU se používají jen k odeslání dotazu nastavenému kompilátoru, aby se získaly definice GNU. IntelliSense bude emulovat ekvivalentní verzi standardu C++.",
	"advanced.settings": "Pokročilá nastavení",
	"configuration.provider": "Poskytovatel konfigurace",
	"configuration.provider.description": "ID rozšíření VS Code, které může poskytnout informace o konfiguraci IntelliSense pro zdrojové soubory. Pokud chcete například poskytnout informace o konfiguraci z rozšíření CMake Tools, použijte ID rozšíření VS Code {0}.",
	"windows.sdk.version": "Verze sady Windows SDK",
	"windows.sdk.version.description": "Verze cesty pro vložené soubory sady Windows SDK, která se má použít ve Windows, např. {0}",
	"mac.framework.path": "Cesta architektury Mac",
	"mac.framework.path.description": "Seznam cest pro modul IntelliSense, který se použije při hledání zahrnutých hlaviček z architektur Mac. Podporuje se jen pro konfigurace pro macOS.",
	"one.path.per.line": "Na každý řádek jedna cesta",
	"forced.include": "Vynucené zahrnutí",
	"forced.include.description": "Seznam souborů, které by se měly zahrnout dříve, než se zpracují jakékoli jiné znaky ve zdrojovém souboru. Soubory se zahrnují v uvedeném pořadí.",
	"one.file.per.line": "Na každý řádek jeden soubor",
	"dot.config": "Konfigurace tečky",
	"dot.config.description": "Cesta k souboru .config vytvořenému systémem Kconfig. Systém Kconfig vygeneruje soubor se všemi definicemi pro sestavení projektu. Příkladem projektů, které používají systém Kconfig, jsou Linux Kernel a NuttX RTOS.",
	"compile.commands": "Příkazy kompilace",
	"compile.commands.description": "Úplná cesta k souboru {0} pro pracovní prostor. Cesty pro vložené soubory a direktivy define v tomto souboru se použijí namísto hodnot nastavených pro nastavení {1} a {2}. Pokud databáze příkazů pro kompilaci neobsahuje položku pro jednotku překladu, která odpovídá souboru otevřenému v editoru, zobrazí se zpráva upozornění a rozšíření místo toho použije nastavení {3} a {4}.",
	"merge.configurations": "Sloučit konfigurace",
	"merge.configurations.description": "Pokud je tato možnost {0} (nebo zaškrtnutá), sloučí cesty k zahrnutým souborům, direktivy define a vynucená zahrnutí s těmi od poskytovatele konfigurace.",
	"browse.path": "Procházení: cesta",
	"browse.path.description": "Seznam cest, na kterých bude analyzátor značek hledat hlavičky zahrnuté zdrojovými soubory. Pokud se vynechá, {0} se použije jako {1}. Hledání na těchto cestách je standardně rekurzivní. Pokud chcete zadat nerekurzivní vyhledávání, zadejte {2}. Příklad: {3} prohledá všechny podadresáře, zatímco {4} ne.",
	"one.browse.path.per.line": "Na každý řádek jedna cesta procházení",
	"limit.symbols": "Procházení: omezení symbolů na zahrnuté hlavičky",
	"limit.symbols.checkbox": "Když se nastaví na {0} (nebo zaškrtne), analyzátor značek bude parsovat jen soubory kódů, které přímo nebo nepřímo zahrnul zdrojový soubor v {1}. Když se nastaví na {2} (nebo nezaškrtne), analyzátor značek bude parsovat všechny soubory kódů nalezené na cestách zadaných v seznamu {3}.",
	"database.filename": "Procházení: název souboru databáze",
	"database.filename.description": "Cesta k vygenerované databázi symbolů. Na základě této možnosti bude rozšíření ukládat databázi symbolů analyzátoru značek někam jinam než do výchozího umístění úložiště pracovního prostoru. Pokud se zadá relativní cesta, bude relativní vzhledem k výchozímu umístění úložiště pracovního prostoru, nikoli k samotné složce pracovního prostoru. Pokud chcete zadat cestu relativní ke složce pracovního prostoru (třeba {1}), dá se použít proměnná {0}."
}