/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"incompatible.extension.heading": "Niekompatybilne lub niepasujące pliki binarne rozszerzenia C/C++",
	"incompat.extension.text1": "Rozszerzenie C/C++ zawiera natywne pliki binarne.",
	"incompat.extension.text2": "Po zainstalowaniu za pośrednictwem interfejsu użytkownika platformy handlowej w programie VS Code należy uwzględnić poprawne natywne pliki binarne. Jeśli wykryto niezgodne pliki binarne i rozszerzenie C/C++ zostało zainstalowane za pośrednictwem interfejsu użytkownika platformy handlowej w programie VS Code, {0}.",
	"bug.report.link.title": "Zgłoś problem",
	"reinstalling.extension.heading": "Ponowne instalowanie rozszerzenia C/C++",
	"reinstall.extension.text1": "Podczas ponownego instalowania równoważnej wersji rozszerzenia, program VS Code może ponownie użyć istniejącego katalogu rozszerzeń. Aby temu zapobiec, podczas ponownej instalacji rozszerzenia C/C++, może być konieczne wstępne usunięcie istniejącego katalogu rozszerzeń.",
	"reinstall.extension.text2": "Zainstalowane katalogi rozszerzeń można znaleźć w jednej z następujących ścieżek w katalogu użytkownika („%USERPROFILE%“ w systemie Windows lub „$HOME“ w systemach Linux i macOS)",
	"reinstall.extension.text3": "W połączeniu zdalnym:",
	"reinstall.extension.text4": "Przykładowe ścieżki do zainstalowanych katalogów rozszerzeń C/C++:",
	"reinstall.extension.text5": "W systemie Windows:",
	"reinstall.extension.text6": "W systemie Linux:",
	"reinstall.extension.text7": "Następnie zainstaluj ponownie za pośrednictwem interfejsu użytkownika platformy handlowej w programie VS Code.",
	"reinstall.extension.text8": "Jeśli prawidłowa wersja rozszerzenia nie zostanie wdrożona przez program VS Code, można {0} i zainstalować poprawny plik VSIX dla Twojego systemu przy użyciu opcji „Zainstaluj z VISIX...“, w menu „...“, w interfejsie użytkownika platformy handlowej w programie VS Code.",
	"download.vsix.link.title": "Pobrano z witryny internetowej platformy handlowej programu VS Code"
}