/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"microsoft.c.cpp.extension": "Microsoft C/C++-Erweiterung",
	"c.cpp.extension": "C/C++-Erweiterung",
	"open.this.editor": "Öffnen Sie diesen Editor mithilfe des folgenden Befehls:",
	"edit.configurations.ui": "C/C++: Konfigurationen bearbeiten (Benutzeroberfläche)",
	"switch.to.json": "Wechseln Sie zur {0}-Datei, indem Sie auf den Link klicken oder diesen Befehl verwenden:",
	"edit.configurations.in.json": "Konfigurationen in JSON-Datei bearbeiten",
	"edit.configurations.json": "C/C++: Konfigurationen bearbeiten (JSON)",
	"check.the.schema": "Weitere Informationen zu den C-/C++-Eigenschaften finden Sie unter {0}.",
	"view.schema.reference": "Referenz zu Eigenschaftsschemas",
	"intellisense.configurations": "IntelliSense-Konfigurationen",
	"intellisense.configurations.description": "Verwenden Sie diesen Editor zum Bearbeiten von IntelliSense-Einstellungen, die in der zugrunde liegenden Datei \"{0}\" definiert sind. In diesem Editor vorgenommene Änderungen gelten nur für die ausgewählte Konfiguration. Um mehrere Konfigurationen gleichzeitig zu bearbeiten, wechseln Sie zu \"{1}\".",
	"configuration.name": "Konfigurationsname",
	"configuration.name.description": "Ein Anzeigename, der eine Konfiguration identifiziert. \"{0}\", \"{1}\" und \"{2}\" sind spezielle Bezeichner für Konfigurationen, die auf diesen Plattformen automatisch ausgewählt werden.",
	"select.configuration.to.edit": "Wählen Sie einen Konfigurationssatz aus, den Sie bearbeiten möchten.",
	"add.configuration.button": "Konfiguration hinzufügen",
	"configuration.name.input": "Konfigurationsname...",
	"ok.button": "OK",
	"cancel.button": "ABBRECHEN",
	"compiler.path": "Compilerpfad",
	"compiler.path.description": "Der vollständige Pfad zum Compiler, den Sie zum Erstellen Ihres Projekts für mehr Genauigkeit bei IntelliSense verwenden (Beispiel: {0}). Die Erweiterung fragt den Compiler ab, um die Systemincludepfade und Standard-Define-Anweisungen für IntelliSense zu ermitteln.",
	"specify.a.compiler": "Geben Sie einen Compilerpfad an, oder wählen Sie einen erkannten Compilerpfad aus der Dropdownliste aus.",
	"no.compiler.paths.detected": "(Keine Compilerpfade erkannt)",
	"compiler.args": "Compilerargumente",
	"compiler.arguments": "Compilerargumente zum Ändern der verwendeten Include- oder Define-Anweisungen. Beispiel: \"{0}\", \"{1}\" usw.",
	"one.argument.per.line": "Ein Argument pro Zeile.",
	"intellisense.mode": "IntelliSense-Modus",
	"intellisense.mode.description": "Der zu verwendende IntelliSense-Modus, der einer Plattform- und Architekturvariante von MSVC, gcc oder Clang zugeordnet wird. Wenn er nicht oder auf \"{0}\" festgelegt wird, wählt die Erweiterung den Standardwert für diese Plattform aus. Bei Windows lautet dieser \"{1}\", bei Linux \"{2}\" und bei macOS \"{3}\". Wählen Sie einen bestimmten IntelliSense-Modus aus, um den Modus \"{4}\" zu überschreiben. IntelliSense-Modi, die nur Varianten in der Form \"{5}\" angeben (z. B. {6}) sind Legacymodi, die basierend auf der Hostplattform automatisch in Varianten des Formats \"{7}\" konvertiert werden.",
	"include.path": "Pfad einbeziehen",
	"include.path.description": "Ein Includepfad ist ein Ordner, der Headerdateien (z. B. \"{0}\") enthält, die in einer Quelldatei enthalten sind. Geben Sie eine Liste mit Pfaden an, die von der IntelliSense-Engine bei der Suche nach eingeschlossenen Headerdateien verwendet werden sollen. Es wird keine rekursive Suche in diesen Pfaden durchgeführt. Geben Sie \"{1}\" an, um eine rekursive Suche durchzuführen. Beispielsweise werden mit der Einstellung \"{2}\" alle Unterverzeichnisse durchsucht, mit der Einstellung \"{3}\" hingegen nicht. Unter Windows mit Visual Studio-Installation oder bei Angabe eines Compilers in der Einstellung \"{4}\" ist es nicht erforderlich, die Systemincludepfade in dieser Liste aufzuführen.",
	"one.include.path.per.line": "Ein Includepfad pro Zeile.",
	"defines": "Define-Anweisungen",
	"defines.description": "Eine Liste der Präprozessordefinitionen für die IntelliSense-Engine, die beim Analysieren von Dateien verwendet werden sollen. Verwenden Sie optional \"{0}\", um einen Wert festzulegen, z. B. \"{1}\".",
	"one.definition.per.line": "Eine Definition pro Zeile.",
	"c.standard": "C-Standard",
	"c.standard.description": "Die Version des C-Sprachstandards, die für IntelliSense verwendet werden soll. Hinweis: GNU-Standards werden nur zum Abfragen des festgelegten Compilers zum Abrufen von GNU-Definitionen verwendet, und IntelliSense emuliert die äquivalente Version des C-Standards.",
	"cpp.standard": "C++-Standard",
	"cpp.standard.description": "Die Version des C++-Sprachstandards, die für IntelliSense verwendet werden soll. Hinweis: GNU-Standards werden nur zum Abfragen des festgelegten Compilers zum Abrufen von GNU-Definitionen verwendet, und IntelliSense emuliert die äquivalente Version des C++-Standards.",
	"advanced.settings": "Erweiterte Einstellungen",
	"configuration.provider": "Konfigurationsanbieter",
	"configuration.provider.description": "Die ID einer VS Code-Erweiterung, die IntelliSense-Konfigurationsinformationen für Quelldateien bereitstellen kann. Verwenden Sie zum Beispiel die VS Code-Erweiterungs-ID \"{0}\", um Konfigurationsinformationen aus der CMake Tools-Erweiterung bereitzustellen.",
	"windows.sdk.version": "Windows SDK-Version",
	"windows.sdk.version.description": "Die Version des Windows SDK-Includepfads zur Verwendung unter Windows, z. B. \"{0}\".",
	"mac.framework.path": "Pfad für Mac-Framework",
	"mac.framework.path.description": "Eine Liste der Pfade für die IntelliSense-Engine, die beim Suchen nach eingeschlossenen Headern aus Mac-Frameworks verwendet werden sollen. Wird nur in Konfigurationen für macOS unterstützt.",
	"one.path.per.line": "Ein Pfad pro Zeile.",
	"forced.include": "Erzwungene Include-Anweisung",
	"forced.include.description": "Eine Liste der Dateien, die eingefügt werden sollen, bevor andere Zeichen in der Quelldatei verarbeitet werden. Die Dateien sind in der aufgelisteten Reihenfolge enthalten.",
	"one.file.per.line": "Eine Datei pro Zeile.",
	"dot.config": "„dotConfig“",
	"dot.config.description": "Ein Pfad zu einer „.config“-Datei, die vom „Kconfig“-System erstellt wurde. Das „Kconfig“-System generiert eine Datei mit allen Definitionen zum Erstellen eines Projekts. Beispiele für Projekte, die das „Kconfig“-System verwenden, sind Linux-Kernel und NuttX-RTOS.",
	"compile.commands": "Kompilierungsbefehle",
	"compile.commands.description": "Der vollständige Pfad zur {0}-Datei für den Arbeitsbereich. Die in dieser Datei ermittelten Includepfade und Define-Anweisungen werden anstelle der für die Einstellungen \"{1}\" und \"{2}\" festgelegten Werte verwendet. Wenn die Datenbank für Kompilierungsbefehle keinen Eintrag für die Übersetzungseinheit enthält, die der im Editor geöffneten Datei entspricht, wird eine Warnmeldung angezeigt, und die Erweiterung verwendet stattdessen die Einstellungen \"{3}\" und \"{4}\".",
	"merge.configurations": "Konfigurationen zusammenführen",
	"merge.configurations.description": "Wenn {0} (oder aktiviert) ist, schließen Sie Includepfade, Definitionen und erzwungene Includes mit denen eines Konfigurationsanbieters zusammen.",
	"browse.path": "Durchsuchen: Pfad",
	"browse.path.description": "Eine Liste der Pfade, in denen der Tagparser nach Headern suchen kann, die in Ihren Quelldateien enthalten sind. Ohne diese Angabe wird \"{0}\" als \"{1}\" verwendet. Die Suche in diesen Pfaden ist standardmäßig rekursiv. Geben Sie \"{2}\" an, um eine nicht rekursive Suche festzulegen. Beispiel: Bei \"{3}\" werden alle Unterverzeichnisse durchsucht, bei \"{4}\" nicht.",
	"one.browse.path.per.line": "Ein Suchpfad pro Zeile.",
	"limit.symbols": "Durchsuchen: Symbole auf eingeschlossene Header begrenzen",
	"limit.symbols.checkbox": "Wenn {0} (oder aktiviert) ist, analysiert der Tagparser nur Codedateien, die direkt oder indirekt von einer Quelldatei in {1} eingeschlossen wurden. Wenn {2} (oder nicht aktiviert) ist, analysiert der Tagparser alle Codedateien, die in den in der {3} Liste angegebenen Pfaden gefunden wurden.",
	"database.filename": "Durchsuchen: Datenbankdateiname",
	"database.filename.description": "Der Pfad zur generierten Symboldatenbank. Hiermit wird die Erweiterung angewiesen, die Symboldatenbank des Tagparsers an einem anderen Speicherort als dem Standardspeicherort des Arbeitsbereichs zu speichern. Bei Angabe eines relativen Pfads wird dieser relativ zum Standardspeicherort des Arbeitsbereichs und nicht zum Arbeitsbereichsordner selbst erstellt. Mit der Variablen \"{0}\" kann ein Pfad relativ zum Arbeitsbereichsordner angegeben werden (Beispiel: {1})."
}