/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"microsoft.c.cpp.extension": "Extensión de Microsoft C/C++",
	"c.cpp.extension": "Extensión de C/C++",
	"open.this.editor": "Abra este editor con el comando:",
	"edit.configurations.ui": "C/C++: Editar configuraciones (UI)",
	"switch.to.json": "Cambie al archivo {0} haciendo clic en el vínculo del archivo o usando el comando:",
	"edit.configurations.in.json": "Editar las configuraciones del archivo JSON",
	"edit.configurations.json": "C/C++: Editar configuraciones (JSON)",
	"check.the.schema": "Para obtener más información sobre las propiedades de C/C++, vaya a {0}.",
	"view.schema.reference": "Referencia al esquema de propiedades",
	"intellisense.configurations": "Configuraciones de IntelliSense",
	"intellisense.configurations.description": "Use este editor para modificar las opciones de IntelliSense definidas en el archivo {0} subyacente. Los cambios que realice en este editor solo se aplicarán en la configuración seleccionada. Para editar varias configuraciones al mismo tiempo, vaya a {1}.",
	"configuration.name": "Nombre de la configuración",
	"configuration.name.description": "Nombre descriptivo que identifica una configuración. {0}, {1} y {2} son identificadores especiales para las configuraciones que se seleccionarán automáticamente en esas plataformas.",
	"select.configuration.to.edit": "Seleccione un conjunto de configuración para editarlo.",
	"add.configuration.button": "Agregar configuración",
	"configuration.name.input": "Nombre de la configuración...",
	"ok.button": "Aceptar",
	"cancel.button": "CANCELAR",
	"compiler.path": "Ruta de acceso del compilador",
	"compiler.path.description": "La ruta de acceso completa al compilador que usa para compilar el proyecto (por ejemplo, {0}) y mejorar la precisión de IntelliSense. La extensión consultará el compilador para determinar las rutas de acceso de inclusión del sistema y las definiciones predeterminadas que se van a usar para IntelliSense.",
	"specify.a.compiler": "Especifique la ruta de acceso de un compilador o seleccione la ruta de acceso de un compilador detectado en la lista desplegable.",
	"no.compiler.paths.detected": "(No se han detectado rutas de acceso del compilador).",
	"compiler.args": "Argumentos del compilador",
	"compiler.arguments": "Argumentos del compilador para modificar las inclusiones o definiciones utilizadas; por ejemplo, {0}, {1}, etc.",
	"one.argument.per.line": "Un argumento por línea.",
	"intellisense.mode": "Modo de IntelliSense",
	"intellisense.mode.description": "Modo IntelliSense que se usa y que se asigna a una variante de plataforma y arquitectura de MSVC, gcc o Clang. Si se establece en {0} o no se establece, la extensión usará el valor predeterminado para esa plataforma. De forma predeterminada, Windows usa {1}, Linux usa {2} y macOS usa {3}. Seleccione un modo IntelliSense específico para reemplazar el modo {4}. Los modos IntelliSense que solo especifican variantes de {5} (por ejemplo, {6}) son modos heredados y se convierten automáticamente a las variantes de {7} en función de la plataforma del host.",
	"include.path": "Ruta de acceso de inclusión",
	"include.path.description": "Una ruta de acceso de inclusión es una carpeta que contiene archivos de encabezado (como {0}) que se incluyen en un archivo de código fuente. Especifique una lista de rutas de acceso que el motor de IntelliSense debe usar al buscar los archivos de encabezado incluidos. La búsqueda en estas rutas de acceso no es recursiva. Especifique {1} para indicar una búsqueda recursiva. Por ejemplo, {2} buscará en todos los subdirectorios, mientras que {3} no lo hará. Si usa Windows y tiene instalado Visual Studio, o bien si se especifica un compilador en la opción {4}, no es necesario mostrar en esta lista las rutas de acceso de inclusión del sistema.",
	"one.include.path.per.line": "Una ruta de acceso de inclusión por línea.",
	"defines": "Defines",
	"defines.description": "Lista de definiciones del preprocesador que el motor de IntelliSense debe usar al analizar los archivos. También puede usar {0} para establecer un valor; por ejemplo, {1}.",
	"one.definition.per.line": "Una definición por línea.",
	"c.standard": "Estándar de C",
	"c.standard.description": "Versión del estándar del lenguaje C que se va a usar para IntelliSense. Nota: Los estándares GNU solo se usan para consultar el compilador de conjuntos a fin de obtener definiciones GNU e IntelliSense emulará la versión del estándar C equivalente.",
	"cpp.standard": "Estándar de C++",
	"cpp.standard.description": "Versión del estándar del lenguaje C++ que se va a usar para IntelliSense. Nota: Los estándares GNU solo se usan para consultar el compilador de conjuntos a fin de obtener definiciones GNU e IntelliSense emulará la versión del estándar C++ equivalente.",
	"advanced.settings": "Configuración avanzada",
	"configuration.provider": "Proveedor de configuración",
	"configuration.provider.description": "Id. de una extensión de VS Code que puede proporcionar información de configuración de IntelliSense para los archivos de código fuente. Por ejemplo, use el id. de extensión de VS Code {0} para proporcionar información de configuración de la extensión Herramientas de CMake.",
	"windows.sdk.version": "Versión del SDK de Windows",
	"windows.sdk.version.description": "Versión de la ruta de acceso de inclusión del SDK de Windows SDK que debe usarse en Windows; por ejemplo, {0}.",
	"mac.framework.path": "Ruta de acceso de la plataforma Mac",
	"mac.framework.path.description": "Lista de rutas de acceso que el motor de IntelliSense debe usar para buscar encabezados incluidos de las plataformas Mac. Solo se admite en configuraciones para macOS.",
	"one.path.per.line": "Una ruta de acceso por línea.",
	"forced.include": "Inclusión forzada",
	"forced.include.description": "Lista de los archivos que deben incluirse antes de que se procesen más caracteres en el archivo de código fuente. Los archivos se incluyen en el orden indicado.",
	"one.file.per.line": "Un archivo por línea.",
	"dot.config": "Dot Config",
	"dot.config.description": "Ruta de acceso a un archivo .config creado por el sistema Kconfig. El sistema Kconfig genera un archivo con todas las definiciones para compilar un proyecto. Algunos ejemplos de proyectos que usan el sistema Kconfig son Kernel Linux y NuttX RTOS.",
	"compile.commands": "Comandos de compilación",
	"compile.commands.description": "Ruta de acceso completa al archivo {0} del área de trabajo. Se usarán las definiciones y rutas de acceso de inclusión detectadas en el archivo, en lugar de los valores establecidos para las opciones {1} y {2}. Si la base de datos de comandos de compilación no contiene una entrada para la unidad de traducción que se corresponda con el archivo que ha abierto en el editor, se mostrará un mensaje de advertencia y la extensión usará las opciones {3} y {4} en su lugar.",
	"merge.configurations": "Combinar configuraciones",
	"merge.configurations.description": "Cuando {0} (o activado), la combinación incluye rutas de acceso, define e incluye forzadas con las de un proveedor de configuración.",
	"browse.path": "Examinar: ruta de acceso",
	"browse.path.description": "Lista de rutas de acceso para que el analizador de etiquetas busque los encabezados incluidos por los archivos de código fuente. Si se omite, se usará {0} como el elemento {1}. De forma predeterminada, la búsqueda en estas rutas de acceso es recursiva. Especifique {2} para indicar una búsqueda no recursiva. Por ejemplo, {3} buscará en todos los subdirectorios, mientras que {4} no lo hará.",
	"one.browse.path.per.line": "Una ruta de acceso de exploración por línea.",
	"limit.symbols": "Examinar: símbolos de límite de los encabezados incluidos",
	"limit.symbols.checkbox": "Cuando {0} (o activado), el analizador de etiquetas solo analizará los archivos de código que un archivo de código fuente haya incluido directa o indirectamente en {1}. Cuando {2} (o no está activado), el analizador de etiquetas analizará todos los archivos de código que se encuentran en las rutas de acceso especificadas en la lista de {3} .",
	"database.filename": "Examinar: nombre del archivo de base de datos",
	"database.filename.description": "La ruta a la base de datos de símbolos generada. Esto indica a la extensión que guarde la base de datos de símbolos del analizador de etiquetas en una ubicación distinta de la ubicación de almacenamiento predeterminada del área de trabajo. Si se especifica una ruta de acceso relativa, será relativa a la ubicación de almacenamiento predeterminada del área de trabajo, no a la carpeta del área de trabajo en sí. La variable {0} se puede usar para especificar una ruta de acceso relativa a la carpeta del área de trabajo (por ejemplo, {1})."
}