/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"microsoft.c.cpp.extension": "Rozszerzenie języka Microsoft C/C++",
	"c.cpp.extension": "Rozszerzenie języka C/C++",
	"open.this.editor": "Otwórz ten edytor przy użyciu polecenia:",
	"edit.configurations.ui": "C/C++: edytuj konfiguracje (interfejs użytkownika)",
	"switch.to.json": "Przełącz do pliku {0}, klikając link pliku lub używając polecenia:",
	"edit.configurations.in.json": "Edytuj konfiguracje w pliku JSON",
	"edit.configurations.json": "C/C++: edytuj konfiguracje (JSON)",
	"check.the.schema": "Dowiedz się więcej o właściwościach języka C/C++, przechodząc do: {0}.",
	"view.schema.reference": "Odwołanie do schematu właściwości",
	"intellisense.configurations": "Konfiguracje funkcji IntelliSense",
	"intellisense.configurations.description": "Użyj tego edytora, aby edytować ustawienia funkcji IntelliSense zdefiniowane w źródłowym pliku {0}. Zmiany wprowadzone w tym edytorze dotyczą tylko wybranej konfiguracji. Aby edytować wiele konfiguracji naraz, przejdź do: {1}.",
	"configuration.name": "Nazwa konfiguracji",
	"configuration.name.description": "Przyjazna nazwa identyfikująca konfigurację. {0}, {1} i {2} są specjalnymi identyfikatorami dla konfiguracji, które zostaną automatycznie wybrane na tych platformach.",
	"select.configuration.to.edit": "Wybierz zestaw konfiguracyjny do edycji.",
	"add.configuration.button": "Dodaj konfigurację",
	"configuration.name.input": "Nazwa konfiguracji...",
	"ok.button": "OK",
	"cancel.button": "ANULUJ",
	"compiler.path": "Ścieżka kompilatora",
	"compiler.path.description": "Pełna ścieżka do kompilatora używanego w celu kompilowania projektu, na przykład {0}. Umożliwia ona zwiększenie dokładności funkcji IntelliSense. Rozszerzenie zbada kompilator, aby ustalić systemowe ścieżki dołączania i domyślne definicje, które mają być używane dla funkcji IntelliSense.",
	"specify.a.compiler": "Określ ścieżkę kompilatora lub wybierz wykrytą ścieżkę kompilatora z listy rozwijanej.",
	"no.compiler.paths.detected": "(Nie wykryto ścieżek kompilatora)",
	"compiler.args": "Argumenty kompilatora",
	"compiler.arguments": "Argumenty kompilatora do modyfikacji użytych elementów include lub define, np. {0}, {1} itp.",
	"one.argument.per.line": "Jeden argument na wiersz.",
	"intellisense.mode": "Tryb funkcji IntelliSense",
	"intellisense.mode.description": "Tryb funkcji IntelliSense do użycia, który jest mapowany na odpowiedni dla platformy i architektury wariant kompilatora MSVC, gcc albo Clang. Jeśli ta wartość nie zostanie ustawiona lub zostanie ustawiona na {0}, rozszerzenie wybierze ustawienie domyślne dla danej platformy. Dla systemu Windows jest używana wartość domyślna {1}, dla systemu Linux — {2}, a dla systemu macOS — {3}. Wybierz określony tryb funkcji IntelliSense, aby zastąpić tryb {4}. Tryby funkcji IntelliSense, które określają tylko warianty {5} (np. {6}) to starsze tryby i są one automatycznie konwertowane na warianty {7} w oparciu o platformę hosta.",
	"include.path": "Ścieżka dołączania",
	"include.path.description": "Ścieżka dołączania to folder zawierający pliki nagłówków (np. {0}), które są dołączane w pliku źródłowym. Określ listę ścieżek do użycia przez aparat IntelliSense podczas wyszukiwania dołączanych plików nagłówków. Wyszukiwanie w tych ścieżkach nie jest rekurencyjne. Użyj wartości {1}, aby określić wyszukiwanie rekurencyjne. Na przykład wartość {2} powoduje przeszukiwanie wszystkich podkatalogów, w przeciwieństwie do wartości {3}. Jeśli jest używany system Windows z zainstalowanym programem Visual Studio lub jeśli został określony kompilator w ustawieniu {4}, nie jest konieczne określanie systemowych ścieżek dołączania na tej liście.",
	"one.include.path.per.line": "Jedna ścieżka dyrektywy include na wiersz.",
	"defines": "Dyrektywy define",
	"defines.description": "Lista definicji preprocesora, które mają być używane przez aparat IntelliSense podczas analizowania plików. Opcjonalnie użyj elementu {0}, aby określić wartość (np. {1}).",
	"one.definition.per.line": "Jedna definicja na wiersz.",
	"c.standard": "Standard języka C",
	"c.standard.description": "Wersja standardu języka C, która ma być używana na potrzeby funkcji IntelliSense. Uwaga: standardy GNU są używane tylko do wykonywania zapytań względem ustawionego kompilatora w celu pobrania dyrektyw define systemu GNU, a funkcja IntelliSense będzie emulować odpowiednią wersję standardu języka C.",
	"cpp.standard": "Standard języka C++",
	"cpp.standard.description": "Wersja standardu języka C++, która ma być używana na potrzeby funkcji IntelliSense. Uwaga: standardy GNU są używane tylko do wykonywania zapytań względem ustawionego kompilatora w celu pobrania dyrektyw define systemu GNU, a funkcja IntelliSense będzie emulować odpowiednią wersję standardu języka C++.",
	"advanced.settings": "Ustawienia zaawansowane",
	"configuration.provider": "Dostawca konfiguracji",
	"configuration.provider.description": "Identyfikator rozszerzenia programu VS Code, które może dostarczać informacje o konfiguracji funkcji IntelliSense dla plików źródłowych. Na przykład użyj identyfikatora rozszerzenia programy VS Code {0}, aby podać informacje o konfiguracji z rozszerzenia narzędzi CMake Tools.",
	"windows.sdk.version": "Wersja zestawu Windows SDK",
	"windows.sdk.version.description": "Wersja ścieżki dyrektywy include zestawu Windows SDK, która ma być używana w systemie Windows, np. {0}.",
	"mac.framework.path": "Ścieżka do platformy Mac",
	"mac.framework.path.description": "Lista ścieżek do użycia przez aparat IntelliSense podczas wyszukiwania dołączonych nagłówków z platform Mac. Obsługiwane tylko w przypadku konfiguracji dla systemu MacOS.",
	"one.path.per.line": "Jedna ścieżka na wiersz.",
	"forced.include": "Wymuszone dołączanie",
	"forced.include.description": "Lista plików, które powinny zostać uwzględnione przed przetworzeniem każdego innego znaku w pliku źródłowym. Pliki są uwzględniane w podanej kolejności.",
	"one.file.per.line": "Jeden plik na wiersz.",
	"dot.config": "Dot Config",
	"dot.config.description": "Ścieżka do pliku .config utworzonego przez system Kconfig. System Kconfig generuje plik ze wszystkimi definicjami na potrzeby kompilowania projektu. Przykłady projektów używających systemu Kconfig to jądro systemu Linux i system NuttX RTOS.",
	"compile.commands": "Polecenia kompilacji",
	"compile.commands.description": "Pełna ścieżka do pliku {0} dla obszaru roboczego. Ścieżki dołączania i definicje wykryte w tym pliku będą używane zamiast wartości określonych dla ustawień {1} i {2}. Jeśli baza danych poleceń kompilacji nie zawiera wpisu dla jednostki translacji odpowiadającej plikowi, który został otwarty w edytorze, pojawi się komunikat ostrzegawczy, a rozszerzenie użyje zamiast tego ustawień {3} i {4}.",
	"merge.configurations": "Scal konfiguracje",
	"merge.configurations.description": "Jeśli wartość jest równa {0} (lub jest zaznaczona), scala ścieżki dołączenia, definiuje i wymusza dołączenie ze ścieżkami od dostawcy konfiguracji.",
	"browse.path": "Przeglądaj: ścieżka",
	"browse.path.description": "Lista ścieżek, w których analizator tagów ma wyszukiwać nagłówki dołączane przez pliki źródłowe. W przypadku pominięcia tego ustawienia zostanie użyte ustawienie: {0} jako: {1}. Wyszukiwanie w tych ścieżkach jest domyślnie rekurencyjne. Użyj wartości {2}, aby określić wyszukiwanie nierekurencyjne. Na przykład wartość {3} spowoduje przeszukanie wszystkich podkatalogów, w przeciwieństwie do wartości {4}.",
	"one.browse.path.per.line": "Jedna ścieżka przeglądania na wiersz.",
	"limit.symbols": "Przeglądaj: ogranicz symbole do dołączonych nagłówków",
	"limit.symbols.checkbox": "Jeśli wartość jest równa {0} (lub jest zaznaczona), analizator tagów analizuje tylko pliki kodu, które zostały bezpośrednio lub pośrednio dołączone przez plik źródłowy w {1}. Jeśli wartość jest równa {2} (lub nie jest zaznaczona), analizator tagów będzie analizować wszystkie pliki kodu znalezione w ścieżkach określonych na {3} liście.",
	"database.filename": "Przeglądaj: nazwa pliku bazy danych",
	"database.filename.description": "Ścieżka do generowanej bazy danych symboli. Określa ona, że rozszerzenie ma zapisać bazę danych symboli analizatora tagów w innym miejscu niż domyślna lokalizacja magazynowania obszaru roboczego. Jeśli zostanie określona ścieżka względna, będzie to ścieżka względem domyślnej lokalizacji magazynowania obszaru roboczego, a nie folderu obszaru roboczego. Można użyć zmiennej {0} do określenia ścieżki względem folderu obszaru roboczego (np. {1})"
}