/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"microsoft.c.cpp.extension": "Estensione Microsoft C/C++",
	"c.cpp.extension": "Estensione C/C++",
	"open.this.editor": "Aprire questo editor usando il comando:",
	"edit.configurations.ui": "C/C++: Modifica configurazioni (interfaccia utente)",
	"switch.to.json": "Passare al file {0} facendo clic sul collegamento del file o usando il comando:",
	"edit.configurations.in.json": "Modifica le configurazioni nel file JSON",
	"edit.configurations.json": "C/C++: Modifica configurazioni (JSON)",
	"check.the.schema": "Per altre informazioni sulle proprietà di C/C++, vedere {0}.",
	"view.schema.reference": "Informazioni di riferimento sullo schema delle proprietà",
	"intellisense.configurations": "Configurazioni IntelliSense",
	"intellisense.configurations.description": "Usare questo editor per modificare le impostazioni di IntelliSense definite nel file {0} sottostante. Le modifiche apportate in questo editor sono valide solo per la configurazione selezionata. Per modificare più configurazioni contemporaneamente, passare a {1}.",
	"configuration.name": "Nome configurazione",
	"configuration.name.description": "Nome descrittivo che identifica una configurazione. {0}, {1} e {2} sono identificatori speciali per le configurazioni che verranno selezionate automaticamente in tali piattaforme.",
	"select.configuration.to.edit": "Selezionare un set di configurazione da modificare.",
	"add.configuration.button": "Aggiungi configurazione",
	"configuration.name.input": "Nome configurazione...",
	"ok.button": "OK",
	"cancel.button": "ANNULLA",
	"compiler.path": "Percorso del compilatore",
	"compiler.path.description": "Percorso completo del compilatore usato per compilare il progetto, ad esempio {0}, per abilitare una versione più accurata di IntelliSense. L'estensione eseguirà una query sul compilatore per determinare i percorsi di inclusione del sistema e le direttive define predefinite da usare per IntelliSense.",
	"specify.a.compiler": "Specificare un percorso del compilatore o selezionare un percorso del compilatore rilevato dall'elenco a discesa.",
	"no.compiler.paths.detected": "(Non sono stati rilevati percorsi del compilatore)",
	"compiler.args": "Argomenti del compilatore",
	"compiler.arguments": "Argomenti del compilatore per modificare le direttive include o define usate, ad esempio {0}, {1} e così via.",
	"one.argument.per.line": "Un argomento per riga.",
	"intellisense.mode": "Modalità IntelliSense",
	"intellisense.mode.description": "Modalità IntelliSense da usare per eseguire il mapping a una variante della piattaforma e dell'architettura di MSVC, gcc o Clang. Se non è impostata o se è impostata su {0}, sarà l'estensione a scegliere il valore predefinito per tale piattaforma. L'impostazione predefinita di Windows è {1}, quella di Linux è {2} e quella di macOS è {3}. Selezionare una modalità IntelliSense specifica per eseguire l'override della modalità {4}. Le modalità IntelliSense che specificano solo varianti {5} (ad esempio {6}) sono modalità legacy e vengono convertite automaticamente nelle varianti {7} in base alla piattaforma host.",
	"include.path": "Includi percorso",
	"include.path.description": "Un percorso di inclusione è una cartella che contiene i file di intestazione, ad esempio {0}, inclusi in un file di origine. Specificare un elenco di percorsi che il motore IntelliSense userà durante la ricerca dei file di intestazione inclusi. La ricerca in questi percorsi non è ricorsiva. Specificare {1} per indicare la ricerca ricorsiva. Ad esempio, con {2} la ricerca sarà estesa a tutte le sottodirectory, mentre con {3} sarà limitata a quella corrente. Se in Windows è installato Visual Studio o se nell'impostazione {4} è specificato un compilatore, non è necessario elencare i percorsi di inclusione di sistema in questo elenco.",
	"one.include.path.per.line": "Un percorso di inclusione per riga.",
	"defines": "Direttive define",
	"defines.description": "Elenco di definizioni del preprocessore che il motore IntelliSense userà durante l'analisi dei file. Facoltativamente, usare {0} per impostare un valore, ad esempio {1}.",
	"one.definition.per.line": "Una definizione per riga.",
	"c.standard": "Standard C",
	"c.standard.description": "Versione dello standard del linguaggio C da usare per IntelliSense. Nota: gli standard GNU vengono usati solo per eseguire query sul compilatore impostato per ottenere le definizioni di GNU. IntelliSense emulerà la versione dello standard di C equivalente.",
	"cpp.standard": "Standard C++",
	"cpp.standard.description": "Versione dello standard del linguaggio C++ da usare per IntelliSense. Nota: gli standard GNU vengono usati solo per eseguire query sul compilatore impostato per ottenere le definizioni di GNU. IntelliSense emulerà la versione dello standard di C++ equivalente.",
	"advanced.settings": "Impostazioni avanzate",
	"configuration.provider": "Provider di configurazione",
	"configuration.provider.description": "ID di un'estensione VS Code che può fornire informazioni di configurazione IntelliSense per i file di origine. Ad esempio, usare l'ID estensione VS Code {0} per fornire le informazioni di configurazione dell'estensione CMake Tools.",
	"windows.sdk.version": "Versione di Windows SDK",
	"windows.sdk.version.description": "Versione del percorso di inclusione di Windows SDK da usare in Windows, ad esempio {0}.",
	"mac.framework.path": "Percorso del framework Mac",
	"mac.framework.path.description": "Elenco di percorsi che il motore IntelliSense userà durante la ricerca delle intestazioni incluse dai framework Mac. Supportato solo nelle configurazioni per macOS.",
	"one.path.per.line": "Un percorso per riga.",
	"forced.include": "Inclusione forzata",
	"forced.include.description": "Elenco di file che devono essere inclusi prima dell'elaborazione di altri caratteri nel file di origine. I file vengono inclusi nell'ordine elencato.",
	"one.file.per.line": "Un file per riga.",
	"dot.config": "Dot Config",
	"dot.config.description": "Il percorso a un file .config creato dal sistema Kconfig. Il sistema Kconfig genera un file con tutte le define per compilare un progetto. Esempi di progetti che usano il sistema Kconfig sono Kernel Linux e NuttX RTOS.",
	"compile.commands": "Comandi di compilazione",
	"compile.commands.description": "Percorso completo del file {0} per l'area di lavoro. Verranno usati i percorsi di inclusione e le direttive define individuati in questo file invece dei valori specificati per le impostazioni {1} e {2}. Se il database dei comandi di compilazione non contiene una voce per l'unità di conversione corrispondente al file aperto nell'editor, verrà visualizzato un messaggio di avviso e l'estensione userà le impostazioni {3} e {4}.",
	"merge.configurations": "Unire configurazioni",
	"merge.configurations.description": "Quando è impostato su {0} (o selezionato), l'unione include percorsi di inclusione, definizioni e inclusioni forzate con quelli di un provider di configurazione.",
	"browse.path": "Sfoglia: percorso",
	"browse.path.description": "Elenco di percorsi in cui il parser di tag può cercare le intestazioni incluse dai file di origine. Se omesso, come {1} verrà usato {0}. Per impostazione predefinita, la ricerca in questi percorsi è ricorsiva. Specificare {2} per indicare la ricerca non ricorsiva. Ad esempio: con {3} la ricerca verrà estesa in tutte le sottodirectory, mentre con {4} sarà limitata a quella corrente.",
	"one.browse.path.per.line": "Un percorso di esplorazione per riga.",
	"limit.symbols": "Sfoglia: limita i simboli alle intestazioni incluse",
	"limit.symbols.checkbox": "Quando è impostato su {0} (o selezionato), il parser tag analizzerà solo i file di codice che sono stati inclusi direttamente o indirettamente da un file di origine in {1}. Quando è impostato su {2} (o non è selezionato), il parser tag analizzerà tutti i file di codice trovati nei percorsi specificati nell'elenco di {3}.",
	"database.filename": "Sfoglia: nome del file di database",
	"database.filename.description": "Percorso del database dei simboli generato. Indica all'estensione di salvare il database dei simboli del parser di tag in un percorso diverso da quello di archiviazione predefinito dell'area di lavoro. Se viene specificato un percorso relativo, sarà relativo al percorso di archiviazione predefinito dell'area di lavoro e non alla cartella dell'area di lavoro. È possibile usare la variabile {0} per specificare un percorso relativo alla cartella dell'area di lavoro, ad esempio {1}"
}