/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"incompatible.extension.heading": "Fichiers binaires d’extension C/C++ incompatibles ou mal assortis",
	"incompat.extension.text1": "L’extension C/C++ inclut des fichiers binaires natifs.",
	"incompat.extension.text2": "Lorsqu’ils sont installés via l’interface utilisateur de la Place de marché dans VS Code, les fichiers binaires natifs appropriés doivent être inclus.  Si des fichiers binaires incompatibles ont été détectés et que l’extension C/C++ a été installée via l’interface utilisateur marketplace dans VS Code, {0}.",
	"bug.report.link.title": "signalez le problème",
	"reinstalling.extension.heading": "Réinstallation de l’extension C/C++",
	"reinstall.extension.text1": "Lors de la réinstallation d’une version équivalente d’une extension, VS Code pouvez réutiliser le répertoire d’extension existant. Pour éviter que cela ne se produise lors de la réinstallation de l’extension C/C++, il peut être nécessaire de supprimer d’abord le répertoire d’extension existant.",
	"reinstall.extension.text2": "Les répertoires d'extension installés peuvent être trouvés sous l'un des chemins suivants sous votre répertoire utilisateur (`%USERPROFILE%` sous Windows ou `$HOME` sous Linux et macOS)",
	"reinstall.extension.text3": "Dans une connexion à distance :",
	"reinstall.extension.text4": "Exemples de chemins d’accès aux répertoires d’extension C/C++ installés :",
	"reinstall.extension.text5": "Sur Windows :",
	"reinstall.extension.text6": "Sur Linux :",
	"reinstall.extension.text7": "Réinstallez ensuite via l’interface utilisateur de la Place de marché dans VS Code.",
	"reinstall.extension.text8": "Si la version correcte de l’extension ne peut pas être déployée par VS Code, le VSIX approprié pour votre système peut être {0} et installé à l’aide de l’option 'Installer à partir de VSIX'...' sous le menu '...' de l’interface utilisateur de la Place de marché dans VS Code.",
	"download.vsix.link.title": "téléchargé à partir du site web de la place de marché VS Code"
}