/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"microsoft.c.cpp.extension": "Extension Microsoft C/C++",
	"c.cpp.extension": "Extension C/C++",
	"open.this.editor": "Ouvrez cet éditeur à l'aide de la commande :",
	"edit.configurations.ui": "C/C++ : Modifier les configurations (IU)",
	"switch.to.json": "Basculez vers le fichier {0} en cliquant sur le lien du fichier ou en utilisant la commande :",
	"edit.configurations.in.json": "Modifier les configurations dans le fichier JSON",
	"edit.configurations.json": "C/C++ : Modifier les configurations (JSON)",
	"check.the.schema": "En savoir plus sur les propriétés C/C++ en accédant à {0}.",
	"view.schema.reference": "Informations de référence sur le schéma des propriétés",
	"intellisense.configurations": "Configurations IntelliSense",
	"intellisense.configurations.description": "Utilisez cet éditeur pour modifier les paramètres IntelliSense définis dans le fichier {0} sous-jacent. Les changements effectués dans cet éditeur s'appliquent uniquement à la configuration sélectionnée. Pour modifier plusieurs configurations à la fois, accédez à {1}.",
	"configuration.name": "Nom de la configuration",
	"configuration.name.description": "Nom convivial qui identifie une configuration. {0}, {1} et {2} sont des identificateurs spéciaux pour les configurations automatiquement sélectionnées sur ces plateformes.",
	"select.configuration.to.edit": "Sélectionnez un ensemble de configurations à modifier.",
	"add.configuration.button": "Ajouter une configuration",
	"configuration.name.input": "Nom de la configuration...",
	"ok.button": "OK",
	"cancel.button": "ANNULER",
	"compiler.path": "Chemin du compilateur",
	"compiler.path.description": "Chemin complet du compilateur utilisé pour générer le projet, par exemple {0}, afin d'améliorer la précision d'IntelliSense. L'extension interroge le compilateur pour déterminer les chemins include système et les définitions par défaut à utiliser pour IntelliSense.",
	"specify.a.compiler": "Spécifiez un chemin de compilateur ou sélectionnez un chemin de compilateur détecté dans la liste déroulante.",
	"no.compiler.paths.detected": "(Aucun chemin de compilateur détecté)",
	"compiler.args": "Arguments du compilateur",
	"compiler.arguments": "Arguments du compilateur permettant de modifier les inclusions ou les définitions utilisées, par exemple, {0}, {1}, etc.",
	"one.argument.per.line": "Un argument par ligne.",
	"intellisense.mode": "Mode IntelliSense",
	"intellisense.mode.description": "Mode IntelliSense à utiliser, qui est mappé à une variante de plateforme et d'architecture de MSVC, gcc ou Clang. En l'absence de valeur définie, ou si la valeur est {0}, l'extension choisit la valeur par défaut pour cette plateforme. Pour Windows, la valeur par défaut est {1}. Pour Linux, la valeur par défaut est {2}. Pour macOS, la valeur par défaut est {3}. Sélectionnez un mode IntelliSense spécifique pour remplacer le mode {4}. Les modes IntelliSense qui spécifient uniquement les variantes {5} (par exemple {6}) sont des modes hérités. Ils sont convertis automatiquement en variantes {7} en fonction de la plateforme hôte.",
	"include.path": "Inclure le chemin",
	"include.path.description": "Un chemin d'inclusion est un dossier qui contient les fichiers d'en-tête (par exemple {0}) inclus dans un fichier source. Spécifiez une liste de chemins à utiliser par le moteur IntelliSense durant la recherche de fichiers d'en-tête inclus. La recherche dans ces chemins n'est pas récursive. Spécifiez {1} pour indiquer une recherche récursive. Par exemple, {2} permet d'effectuer une recherche parmi tous les sous-répertoires, ce qui n'est pas le cas de {3}.  Si Visual Studio est installé sur Windows, ou si un compilateur est spécifié dans le paramètre {4}, il n'est pas nécessaire de faire figurer les chemins d'inclusion système dans cette liste.",
	"one.include.path.per.line": "Un chemin d'inclusion par ligne.",
	"defines": "Définitions",
	"defines.description": "Liste des définitions de préprocesseur que le moteur IntelliSense doit utiliser pendant l'analyse des fichiers. Vous pouvez aussi utiliser {0} pour définir une valeur, par ex., {1}.",
	"one.definition.per.line": "Une définition par ligne.",
	"c.standard": "C standard",
	"c.standard.description": "Version de la norme de langage C à utiliser pour IntelliSense. Remarque : Les normes GNU sont utilisées uniquement pour interroger le compilateur défini afin d'obtenir les définitions GNU. IntelliSense émule la version C normalisée équivalente.",
	"cpp.standard": "C++ standard",
	"cpp.standard.description": "Version de la norme de langage C++ à utiliser pour IntelliSense. Remarque : Les normes GNU sont utilisées uniquement pour interroger le compilateur défini afin d'obtenir les définitions GNU. IntelliSense émule la version C++ normalisée équivalente.",
	"advanced.settings": "Paramètres avancés",
	"configuration.provider": "Fournisseur de configuration",
	"configuration.provider.description": "ID d'une extension VS Code qui peut fournir des informations de configuration IntelliSense pour les fichiers sources. Par exemple, utilisez l'ID d'extension VS Code {0} pour fournir des informations de configuration de l'extension CMake Tools.",
	"windows.sdk.version": "Version du SDK Windows",
	"windows.sdk.version.description": "Version du chemin d'inclusion du SDK Windows à utiliser sur Windows, par ex., {0}.",
	"mac.framework.path": "Chemin du framework Mac",
	"mac.framework.path.description": "Liste de chemins que le moteur IntelliSense doit utiliser pour la recherche des en-têtes inclus dans les frameworks Mac. Prise en charge uniquement sur les configurations pour macOS.",
	"one.path.per.line": "Un chemin par ligne.",
	"forced.include": "Inclusion forcée",
	"forced.include.description": "Liste des fichiers qui doivent être inclus avant le traitement de tous les autres caractères du fichier source. Les fichiers sont inclus dans l'ordre indiqué.",
	"one.file.per.line": "Un fichier par ligne.",
	"dot.config": "Dot Config",
	"dot.config.description": "Chemin d’accès à un fichier .config créé par le système Kconfig. Le système Kconfig génère un fichier avec toutes les définitions pour générer un projet. Les exemples de projets qui utilisent le système Kconfig sont le noyau Linux et NuttX RTOS.",
	"compile.commands": "Commandes de compilation",
	"compile.commands.description": "Chemin complet du fichier {0} pour l'espace de travail. Les chemins d'inclusion et les définitions découverts dans ce fichier sont utilisés à la place des valeurs définies pour les paramètres {1} et {2}. Si la base de données des commandes de compilation n'a pas d'entrée pour l'unité de traduction qui correspond au fichier que vous avez ouvert dans l'éditeur, un message d'avertissement s'affiche et l'extension utilise les paramètres {3} et {4} à la place.",
	"merge.configurations": "Fusionner les configurations",
	"merge.configurations.description": "Lorsque {0} (ou activé), la fusion inclut des chemins d’accès, des définitions et des éléments forcés avec ceux d’un fournisseur de configuration.",
	"browse.path": "Parcourir : chemin",
	"browse.path.description": "Liste de chemins dans lesquels l'analyseur de balises doit rechercher les en-têtes inclus par vos fichiers sources. En cas d'omission, {0} est utilisé comme {1}. La recherche dans ces chemins est récursive par défaut. Spécifiez {2} pour indiquer une recherche non récursive. Par exemple : {3} effectue une recherche dans tous les sous-répertoires, contrairement à {4}.",
	"one.browse.path.per.line": "Un chemin de navigation par ligne.",
	"limit.symbols": "Parcourir : limiter les symboles aux en-têtes inclus",
	"limit.symbols.checkbox": "Lorsque {0} (ou activé), l’analyseur de balise analyse uniquement les fichiers de code qui ont été inclus directement ou indirectement par un fichier source dans {1}. Lorsque {2} (ou non activé), l’analyseur de balise analyse tous les fichiers de code trouvés dans les chemins d’accès spécifiés dans la liste {3} .",
	"database.filename": "Parcourir : nom de fichier de base de données",
	"database.filename.description": "Chemin de la base de données de symboles générée. Cela indique à l'extension d'enregistrer la base de données de symboles de l'analyseur de balises à un emplacement autre que l'emplacement de stockage par défaut de l'espace de travail. Si un chemin relatif est spécifié, il est relatif à l'emplacement de stockage par défaut de l'espace de travail et non au dossier d'espace de travail lui-même. La variable {0} peut être utilisée pour spécifier un chemin relatif au dossier d'espace de travail (par ex., {1})"
}