/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"microsoft.c.cpp.extension": "Microsoft C/C++ Uzantısı",
	"c.cpp.extension": "C/C++ Uzantısı",
	"open.this.editor": "Şu komutu kullanarak bu düzenleyiciyi aç:",
	"edit.configurations.ui": "C/C++: Yapılandırmaları düzenle (UI)",
	"switch.to.json": "Dosya bağlantısına tıklayarak veya şu komutu kullanarak {0} dosyasına geçiş yapın:",
	"edit.configurations.in.json": "JSON dosyasındaki yapılandırmaları düzenle",
	"edit.configurations.json": "C/C++: Yapılandırmaları düzenle (JSON)",
	"check.the.schema": "{0} adresine giderek C/C++ özellikleri hakkında daha fazla bilgi edinin.",
	"view.schema.reference": "Özellikler Şema Başvurusu",
	"intellisense.configurations": "IntelliSense Yapılandırmaları",
	"intellisense.configurations.description": "Temel alınan {0} dosyasında tanımlanan IntelliSense ayarlarını düzenlemek için bu düzenleyiciyi kullanın. Bu düzenleyicide yapılan değişiklikler yalnızca seçili yapılandırma için geçerlidir. Aynı anda birden çok yapılandırmayı düzenlemek için {1} seçeneğine gidin.",
	"configuration.name": "Yapılandırma adı",
	"configuration.name.description": "Yapılandırmayı tanımlayan bir kolay ad. {0}, {1} ve {2}, bu platformlarda otomatik olarak seçilecek yapılandırmalar için özel tanımlayıcılardır.",
	"select.configuration.to.edit": "Düzenlemek için bir yapılandırma kümesi seçin.",
	"add.configuration.button": "Yapılandırma Ekle",
	"configuration.name.input": "Yapılandırma adı...",
	"ok.button": "Tamam",
	"cancel.button": "İPTAL",
	"compiler.path": "Derleyici yolu",
	"compiler.path.description": "Projenizi derlemek için kullandığınız derleyicinin tam yolu, örneğin, daha doğru IntelliSense'i etkinleştirmek için {0}. Uzantı, IntelliSense için kullanılacak sistem ekleme yollarını ve varsayılan tanımları belirlemek için derleyiciyi sorgular.",
	"specify.a.compiler": "Derleyici yolunu belirtin veya açılan listeden, algılanan bir derleyici yolu seçin.",
	"no.compiler.paths.detected": "(Derleyici yolu algılanmadı)",
	"compiler.args": "Derleyici bağımsız değişkenleri",
	"compiler.arguments": "Kullanılan eklemeleri veya tanımları değiştirmek için derleyici bağımsız değişkenleri. Örneğin {0}, {1}, vb.",
	"one.argument.per.line": "Satır başına bir bağımsız değişken.",
	"intellisense.mode": "IntelliSense modu",
	"intellisense.mode.description": "MSVC, gcc veya Clang'in platform ve mimari varyantına eşlemek için kullanılacak IntelliSense modu. Ayarlanmazsa veya {0} olarak belirlenirse uzantı, ilgili platform için varsayılan ayarı seçer. Windows için varsayılan olarak {1}, Linux için varsayılan olarak {2} ve macOS için varsayılan olarak {3} kullanılır. {4} modunu geçersiz kılmak için belirli bir IntelliSense modunu seçin. Yalnızca {5} varyantlarını belirten IntelliSense modları (yani {6}), eski modlardır ve konak platformuna göre otomatik olarak {7} varyantlarına dönüştürülür.",
	"include.path": "Yol ekle",
	"include.path.description": "Ekleme yolu, kaynak dosyasına dahil edilen üst bilgi dosyalarını ({0} gibi) içeren bir klasördür. IntelliSense altyapısının eklenen üst bilgi dosyalarını ararken kullanacağı yolların bir listesini belirtin. Bu yollarda arama özyinelemeli değildir. Özyinelemeli aramayı göstermek için {1} belirtin. Örneğin, {2} tüm alt dizinleri ararken {3} aramaz. Visual Studio yüklü Windows kullanıyorsanız veya {4} ayarında bir derleyici belirtilmişse bu listede sistem ekleme yollarının listelenmesi gerekmez.",
	"one.include.path.per.line": "Satır başına bir ekleme yolu.",
	"defines": "Tanımlar",
	"defines.description": "IntelliSense altyapısının dosyaları ayrıştırırken kullanacağı ön işlemci tanımlarının bir listesi. İsteğe bağlı olarak, bir değer ayarlamak için {0} kullanın, örneğin {1}.",
	"one.definition.per.line": "Satır başına bir tanım.",
	"c.standard": "C standardı",
	"c.standard.description": "IntelliSense için kullanılacak C dil standardı sürümü. Not: GNU standartları yalnızca GNU tanımlarını almak için ayarlanan derleyiciyi sorgulamak amacıyla kullanılır ve IntelliSense eşdeğer C standart sürümüne öykünür.",
	"cpp.standard": "C++ standardı",
	"cpp.standard.description": "IntelliSense için kullanılacak C++ dil standardı sürümü. Not: GNU standartları yalnızca GNU tanımlarını almak için ayarlanan derleyiciyi sorgulamak amacıyla kullanılır ve IntelliSense, eşdeğer C++ standart sürümüne öykünür.",
	"advanced.settings": "Gelişmiş Ayarlar",
	"configuration.provider": "Yapılandırma sağlayıcısı",
	"configuration.provider.description": "Kaynak dosyalar için IntelliSense yapılandırma bilgilerini sağlayabilecek VS Code uzantısının kimliği. Örneğin, CMake Araçları uzantısındaki yapılandırma bilgilerini sağlamak için VS Code {0} uzantı kimliğini kullanın.",
	"windows.sdk.version": "Windows SDK sürümü",
	"windows.sdk.version.description": "Windows üzerinde kullanılacak Windows SDK ekleme yolu sürümü, örneğin {0}.",
	"mac.framework.path": "Mac çerçevesi yolu",
	"mac.framework.path.description": "Mac çerçevelerinden eklenen üst bilgileri ararken IntelliSense altyapısı tarafından kullanılacak yolların listesi. Yalnızca macOS yapılandırmalarında desteklenir.",
	"one.path.per.line": "Satır başına bir yol.",
	"forced.include": "Zorlamalı ekleme",
	"forced.include.description": "Kaynak dosyadaki başka herhangi bir karakter işlenmeden önce eklenmesi gereken dosyaların listesi. Dosyalar listelendikleri sırada eklenir.",
	"one.file.per.line": "Satır başına bir dosya.",
	"dot.config": "Nokta Yapılandırması",
	"dot.config.description": "Kconfig sistemi tarafından oluşturulan bir .config dosyasının yolu. Kconfig sistemi, bir proje oluşturmak için tüm tanımlamaları içeren bir dosya oluşturur. Kconfig sistemini kullanan projelere örnek olarak Linux Çekirdeği ve NuttX RTOS verilebilir.",
	"compile.commands": "Derleme komutları",
	"compile.commands.description": "Çalışma alanı için {0} dosyasının tam yolu. {1} ve {2} ayarları için ayarlanan değerler yerine bu dosyada bulunan içerme yolları ve tanımlar kullanılır. Derleme komutları veritabanı, düzenleyicide açtığınız dosyaya karşılık gelen çeviri birimi için bir giriş içermiyorsa, bir uyarı mesajı görüntülenir ve uzantı bunun yerine {3} ve {4} ayarlarını kullanır.",
	"merge.configurations": "Yapılandırmaları birleştir",
	"merge.configurations.description": "{0} (veya işaretli) olduğunda, dahil etme yollarını, tanımları ve bir yapılandırma sağlayıcısından gelenlerle zorunlu dahil etmeleri birleştir.",
	"browse.path": "Gözat: yol",
	"browse.path.description": "Etiket Ayrıştırıcısının kaynak dosyalarınızın içerdiği üst bilgileri arayacağı yolların listesi. Atlanırsa, {1} olarak {0} kullanılır. Bu yollarda arama varsayılan olarak özyinelemelidir. Özyinelemeli olmayan aramayı belirtmek için {2} belirtin. Örneğin: {3}, tüm alt dizinlerde arar ancak {4} aramaz.",
	"one.browse.path.per.line": "Satır başına bir gözatma yolu.",
	"limit.symbols": "Gözat: sembolleri eklenen üst bilgilerle sınırla",
	"limit.symbols.checkbox": "{0} (veya işaretli) olduğunda, Etiket Ayrıştırıcı yalnızca {1} içindeki bir kaynak dosya tarafından doğrudan veya dolaylı olarak dahil edilen kod dosyalarını ayrıştırır. {2} olduğunda (veya işaretlenmediğinde), Etiket Ayrıştırıcı {3} listesinde belirtilen yollarda bulunan tüm kod dosyalarını ayrıştırır.",
	"database.filename": "Gözat: veritabanı dosya adı",
	"database.filename.description": "Oluşturulan sembol veritabanının yolu. Bu, uzantının Etiket Ayrıştırıcısının sembol veritabanının çalışma alanı varsayılan depolama konumundan başka bir yerde kaydedilmesini sağlar. Göreli yol belirtilirse, çalışma alanı klasörünün kendisi değil, çalışma alanının varsayılan depolama konumuyla göreli olarak yapılır. {0} değişkeni, çalışma alanı klasörüne göreli bir yol belirtmek için kullanılabilir (örneğin, {1})"
}