/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"incompatible.extension.heading": "Nekompatibilní nebo neodpovídající binární soubory rozšíření C/C++",
	"incompat.extension.text1": "Rozšíření C/C++ obsahuje nativní binární soubory.",
	"incompat.extension.text2": "Při instalaci přes rozhraní tržiště ve VS Code by měly být zahrnuty správné nativní binární soubory.  Pokud byly zjištěny nekompatibilní binární soubory a rozšíření C/C++ bylo nainstalováno prostřednictvím uživatelského rozhraní tržiště ve VS Code, {0}.",
	"bug.report.link.title": "nahlaste prosím problém",
	"reinstalling.extension.heading": "Přeinstaluje se rozšíření C/C++.",
	"reinstall.extension.text1": "Při přeinstalování ekvivalentní verze rozšíření může VS Code znovu použít stávající adresář rozšíření. Aby k tomu při přeinstalování rozšíření C/C++ nedošlo, může být nutné stávající adresář rozšíření nejprve odstranit.",
	"reinstall.extension.text2": "Nainstalované adresáře rozšíření najdete v jedné z následujících cest v uživatelském adresáři (`%USERPROFILE%` v systému Windows nebo `$HOME` v systémech Linux a macOS).",
	"reinstall.extension.text3": "Ve vzdáleném připojení:",
	"reinstall.extension.text4": "Ukázkové cesty k nainstalovaným adresářům rozšíření C/C++:",
	"reinstall.extension.text5": "Ve Windows:",
	"reinstall.extension.text6": "V Linuxu:",
	"reinstall.extension.text7": "Pak ji znovu nainstalujte přes uživatelské rozhraní Marketplace ve VS Code.",
	"reinstall.extension.text8": "Pokud VS Code nenasadí správnou verzi rozšíření, můžete správný soubor VSIX pro váš systém {0} a nainstalovat pomocí možnosti `Instalovat z VSIX...`. v uživatelském rozhraní Marketplace ve VS Code.",
	"download.vsix.link.title": "staženo z webu VS Code Marketplace"
}