/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"microsoft.c.cpp.extension": "Расширение C/C++ (Майкрософт)",
	"c.cpp.extension": "Расширение C/C++",
	"open.this.editor": "Откройте этот редактор с помощью команды:",
	"edit.configurations.ui": "C/C++: изменение конфигураций (пользовательский интерфейс)",
	"switch.to.json": "Переключитесь на файл {0}, щелкнув ссылку на него или используя команду:",
	"edit.configurations.in.json": "Изменение конфигураций в файле JSON",
	"edit.configurations.json": "C/C++: изменение конфигураций (JSON)",
	"check.the.schema": "Дополнительные сведения о свойствах C/C++ см. в {0}.",
	"view.schema.reference": "Справочник по схеме свойств",
	"intellisense.configurations": "Конфигурации IntelliSense",
	"intellisense.configurations.description": "Используйте этот редактор для изменения параметров IntelliSense, определенных в базовом файле {0}. Изменения в этом редакторе применяются только к выбранной конфигурации. Для изменения множества конфигураций сразу перейдите сюда: {1}.",
	"configuration.name": "Имя конфигурации",
	"configuration.name.description": "Понятное имя, идентифицирующее конфигурацию. {0}, {1} и {2} — это специальные идентификаторы для конфигураций, которые будут автоматически выбраны на этих платформах.",
	"select.configuration.to.edit": "Выберите файл конфигурации для изменения.",
	"add.configuration.button": "Добавить конфигурацию",
	"configuration.name.input": "Имя конфигурации...",
	"ok.button": "ОК",
	"cancel.button": "Отмена",
	"compiler.path": "Путь компилятора",
	"compiler.path.description": "Полный путь к компилятору, используемому для сборки проекта, например {0}, для повышения точности IntelliSense. Расширение будет запрашивать у компилятора системные пути для include и директивы define по умолчанию для использования в IntelliSense.",
	"specify.a.compiler": "Укажите путь компилятора или выберите обнаруженный путь компилятора в раскрывающемся списке.",
	"no.compiler.paths.detected": "(Пути компилятора не обнаружены.)",
	"compiler.args": "Аргументы компилятора",
	"compiler.arguments": "Аргументы компилятора для изменения используемых включений или определений, например {0}, {1} и т. д.",
	"one.argument.per.line": "Один аргумент в строке.",
	"intellisense.mode": "Режим IntelliSense",
	"intellisense.mode.description": "Используемый режим IntelliSense, соответствующий определенному варианту платформы и архитектуры MSVC, gcc или Clang. Если значение не указано или указано значение {0}, расширение выберет вариант по умолчанию для этой платформы. Для Windows по умолчанию используется {1}, для Linux — {2}, а для macOS — {3}. Вы можете переопределить режим {4}, выбрав конкретный режим IntelliSense. Режимы IntelliSense, в которых указаны только варианты {5} (например, {6}), являются устаревшими и автоматически преобразуются в варианты {7} на основе платформы узла.",
	"include.path": "Включить путь",
	"include.path.description": "Путь включения — это папка, содержащая файлы заголовков (например, {0}), включаемые в исходный файл. Укажите список путей, которые подсистема IntelliSense будет использовать для поиска заголовков. Поиск по этим путям не является рекурсивным. Чтобы использовать рекурсивный поиск, укажите {1}. Например, если указать {2}, то будет выполнен поиск по всем подкаталогам, а если указать {3} — не будет. Если вы работаете в Windows с установленной средой Visual Studio или в параметре {4} указан компилятор, перечислять системные пути включения в этом списке не нужно.",
	"one.include.path.per.line": "Один путь включения в строке.",
	"defines": "Определения",
	"defines.description": "Список определений препроцессора для подсистемы IntelliSense, используемых при анализе файлов. При необходимости используйте {0} для задания значения, например {1}.",
	"one.definition.per.line": "Одно определение в строке.",
	"c.standard": "Стандарт C",
	"c.standard.description": "Версия стандарта языка C, используемая для IntelliSense. Примечание: стандарты GNU используются только для запроса определений GNU у установленного компилятора, а IntelliSense будет эмулировать эквивалентную версию стандарта C.",
	"cpp.standard": "Стандарт C++",
	"cpp.standard.description": "Версия стандарта языка C++, используемая для IntelliSense. Примечание: стандарты GNU используются только для запроса определений GNU у установленного компилятора, а IntelliSense будет эмулировать эквивалентную версию стандарта C++.",
	"advanced.settings": "Дополнительные параметры",
	"configuration.provider": "Поставщик конфигурации",
	"configuration.provider.description": "Идентификатор расширения VS Code, которое может предоставлять сведения о конфигурации IntelliSense для исходных файлов. Например, используйте идентификатор расширения VS Code {0}, чтобы предоставить сведения о конфигурации из расширения \"Средства CMake\".",
	"windows.sdk.version": "Версия Windows SDK",
	"windows.sdk.version.description": "Версия пути включения Windows SDK для использования в Windows, например {0}.",
	"mac.framework.path": "Путь к платформе Mac",
	"mac.framework.path.description": "Список путей для подсистемы IntelliSense, используемых при поиске включенных заголовков из платформ Mac. Поддерживается только в конфигурациях для macOS.",
	"one.path.per.line": "Один путь в строке.",
	"forced.include": "Принудительное включение",
	"forced.include.description": "Список файлов, которые должны быть включены до обработки любых других символов в исходном файле. Файлы включаются в указанном порядке.",
	"one.file.per.line": "Один файл в строке.",
	"dot.config": "Конфигурация dot",
	"dot.config.description": "Путь к файлу CONFIG, созданному системой Kconfig. Система Kconfig создает файл со всеми определениями для сборки проекта. Примеры проектов, в которых используется система Kconfig: ядро Linux и NuttX RTOS.",
	"compile.commands": "Команды компиляции",
	"compile.commands.description": "Полный путь к файлу {0} для рабочей области. Обнаруженные в этом файле пути для включений и определения будут использоваться вместо значений, заданных для параметров {1} и {2}. Если база данных команд сборки не содержит запись для единицы трансляции, соответствующей открытому в редакторе файлу, то появится предупреждающее сообщение и расширение будет использовать параметры {3} и {4}.",
	"merge.configurations": "Объединение конфигураций",
	"merge.configurations.description": "При значении {0} (или если установлен флажок) пути включения, определения и принудительные включения будут объединены с аналогичными элементами от поставщика конфигурации.",
	"browse.path": "Обзор: путь",
	"browse.path.description": "Список путей, по которым анализатор тегов будет искать файлы заголовков, включаемые вашими исходными файлами. Если не указать его, то как {1} будет использоваться {0}. Поиск по этим путям по умолчанию рекурсивный. Чтобы использовать нерекурсивный, укажите {2}. Например, если указать {3}, будет выполнен поиск по всем подкаталогам, а если {4} — не будет.",
	"one.browse.path.per.line": "Один путь просмотра в строке.",
	"limit.symbols": "Обзор: ограничение символов до включаемых заголовков",
	"limit.symbols.checkbox": "При значении {0} (или если установлен флажок) анализатор тегов будет анализировать только файлы кода, прямо или косвенно включаемые исходным файлом в {1}. При значении {2} (или если флажок не установлен) анализатор тегов будет анализировать все файлы кода, найденные по путям, указанным в списке {3}.",
	"database.filename": "Обзор: имя файла базы данных",
	"database.filename.description": "Путь к создаваемой базе данных символов. Этот параметр задает расширению альтернативное место хранения базы данных символов для анализатора тегов, отличное от используемого в рабочей области расположения по умолчанию. При указании относительного пути он будет отсчитываться от места хранения по умолчанию, а не от папки самой рабочей области. Чтобы указать путь относительно папки рабочей области (например: {1}), используйте переменную {0}."
}